In [2]:
import numpy as np
import pandas as pd

# 1. Series

* A data type that is comprised of index and values
* A Series object contains elements of single data type
* Series is the data structure for a single column of a DataFrame

### 1.1 Create Series

In [3]:
#passing in only values automatically creates an index from 0 as default
data = pd.Series(np.random.randint(10, size=5))
data

0    4
1    0
2    7
3    4
4    6
dtype: int64

In [4]:
#setting index
data = pd.Series(np.random.randint(10, size=5), 
                index=list("ABCDE"))
data

A    9
B    4
C    3
D    8
E    2
dtype: int64

In [5]:
data.index, data.values

(Index(['A', 'B', 'C', 'D', 'E'], dtype='object'), array([9, 4, 3, 8, 2]))

### 1.2 Offset Index

* You can use index names to access specific elements in a Series object
* Works very similar to numpy arrays

In [6]:
#indexing specific index
data["B"], data.B

(4, 4)

In [7]:
#replacing values
data["C"] = 10
data

A     9
B     4
C    10
D     8
E     2
dtype: int64

In [8]:
#broadcasting
data * 10

A     90
B     40
C    100
D     80
E     20
dtype: int64

In [9]:
#selecting multiple indices
data[["B","E"]]

B    4
E    2
dtype: int64

In [10]:
#offset index
data[2::2]

C    10
E     2
dtype: int64

In [11]:
#offset index
data[::-1]

E     2
D     8
C    10
B     4
A     9
dtype: int64

### 1.3 Series Operation

* Series operations are conducted for elements in Series objets that share the same index values
* Index is preserved, that is, for index where values don't exist in BOTH of Seris objects, we get NULL values

In [12]:
data

A     9
B     4
C    10
D     8
E     2
dtype: int64

In [13]:
data2 = pd.Series({"D":3, "E":5, "F":7})
data2

D    3
E    5
F    7
dtype: int64

In [14]:
result = data + data2
result # None

A     NaN
B     NaN
C     NaN
D    11.0
E     7.0
F     NaN
dtype: float64

# 2. DataFrame

* Comprised of multiple Series
* Values in same columns share identical data types

### 2.1 Creating Dataframes

In [15]:
#using a dictionary
#key values become column names
#creating by column
datas = {
    "name":["dss", "fcamp"],
    "email":["dss@gmail.com", "fcamp@daum.net"],
}

df = pd.DataFrame(datas)
df

    name           email
0    dss   dss@gmail.com
1  fcamp  fcamp@daum.net

In [16]:
#using a list
#key values become column names
#creating by row. Each dictionary within a list becomes a row
datas = [
    {"name":"dss", "email":"dss@gmail.com"},
    {"name":"fcamp", "email":"fcamp@daum.net"},
]

df = pd.DataFrame(datas)
df

    name           email
0    dss   dss@gmail.com
1  fcamp  fcamp@daum.net

### 2.2 Adding Index

In [17]:
#set index
df = pd.DataFrame(datas, index=["one", "two"])
df

      name           email
one    dss   dss@gmail.com
two  fcamp  fcamp@daum.net

### 2.3 Handling DataFrames

In [18]:
df.index

Index(['one', 'two'], dtype='object')

In [19]:
df.columns

Index(['name', 'email'], dtype='object')

In [20]:
df.values

array([['dss', 'dss@gmail.com'],
       ['fcamp', 'fcamp@daum.net']], dtype=object)

### 2.4 Accessing Elements

In [21]:
df = pd.DataFrame(datas)
df

    name           email
0    dss   dss@gmail.com
1  fcamp  fcamp@daum.net

In [22]:
#select row: loc
#this is also a Series object
df.loc[1]

name              fcamp
email    fcamp@daum.net
Name: 1, dtype: object

In [23]:
#therefore you can access specific element
df.loc[1]["email"]

'fcamp@daum.net'

In [24]:
#you can add a row
#if the index already exists then you are editing the row values
#if the index doesn't exist, then you are inserting a new row
df.loc[2] = {"name": "andy", "email": "andy@naver.com"}
df

    name           email
0    dss   dss@gmail.com
1  fcamp  fcamp@daum.net
2   andy  andy@naver.com

In [25]:
#select column
df["name"]

0      dss
1    fcamp
2     andy
Name: name, dtype: object

In [26]:
#insert column
df["id"] = [1, 2, 3]
df

    name           email  id
0    dss   dss@gmail.com   1
1  fcamp  fcamp@daum.net   2
2   andy  andy@naver.com   3

In [27]:
#select row and column
df.loc[[0, 2], ["email", "id"]]

            email  id
0   dss@gmail.com   1
2  andy@naver.com   3

### 2.5 Apply Function

* To every element of a Series object, you can apply a function

In [28]:
def domain(email):
    return email.split("@")[1].split(".")[0]

domain(df.loc[0]["email"])

'gmail'

In [29]:
#this apply function is function of Series object
df["domain"] = df["email"].apply(domain)
df

    name           email  id domain
0    dss   dss@gmail.com   1  gmail
1  fcamp  fcamp@daum.net   2   daum
2   andy  andy@naver.com   3  naver

In [30]:
#using lambda
df["domain_new"] = df["email"].apply(lambda email: email.split("@")[1].split(".")[0])
df

    name           email  id domain domain_new
0    dss   dss@gmail.com   1  gmail      gmail
1  fcamp  fcamp@daum.net   2   daum       daum
2   andy  andy@naver.com   3  naver      naver

# 3. DataFrame Practice

In [31]:
from makedata import *

df1 = pd.DataFrame(make_data(5))
df2 = pd.DataFrame(make_data(5))
df2

   Age     Name
0   30   Arnold
1   33    Billy
2   40     Alan
3   27  Anthony
4   38     Alan

### 3.1 Append Dataframes

* Append vertically
* Resulting dataframe inherits index from previous dataframes

In [32]:
df3 = df1.append(df2)
df3.head()

   Age     Name
0   37    Billy
1   33  Anthony
2   22    Billy
3   37      Jin
4   28    Billy

In [33]:
#reset index
df3.reset_index(drop=True, inplace=True)
df3.head()

   Age     Name
0   37    Billy
1   33  Anthony
2   22    Billy
3   37      Jin
4   28    Billy

In [34]:
#Or you can adjust the setting during appending procedure
df3 = df1.append(df2, ignore_index=True)
df3.head()

   Age     Name
0   37    Billy
1   33  Anthony
2   22    Billy
3   37      Jin
4   28    Billy

### 3.2 Concatenate Dataframes

* Allows you to combine dataframes both vertically and horizontally

In [35]:
df1.head()

   Age     Name
0   37    Billy
1   33  Anthony
2   22    Billy
3   37      Jin
4   28    Billy

In [36]:
df2.head()

   Age     Name
0   30   Arnold
1   33    Billy
2   40     Alan
3   27  Anthony
4   38     Alan

In [37]:
#you need to pass in the dataframes as a list
#default concat axis = 0
df3 = pd.concat([df1, df2]).reset_index(drop = True)
df3

   Age     Name
0   37    Billy
1   33  Anthony
2   22    Billy
3   37      Jin
4   28    Billy
5   30   Arnold
6   33    Billy
7   40     Alan
8   27  Anthony
9   38     Alan

In [38]:
#vertically, default is join outer
pd.concat([df3, df1], axis=1)

   Age     Name   Age     Name
0   37    Billy  37.0    Billy
1   33  Anthony  33.0  Anthony
2   22    Billy  22.0    Billy
3   37      Jin  37.0      Jin
4   28    Billy  28.0    Billy
5   30   Arnold   NaN      NaN
6   33    Billy   NaN      NaN
7   40     Alan   NaN      NaN
8   27  Anthony   NaN      NaN
9   38     Alan   NaN      NaN

In [39]:
pd.concat([df3, df1], axis=1, join='inner')

   Age     Name  Age     Name
0   37    Billy   37    Billy
1   33  Anthony   33  Anthony
2   22    Billy   22    Billy
3   37      Jin   37      Jin
4   28    Billy   28    Billy

# 4. Group By

In [40]:
df = pd.DataFrame(make_data())
df

   Age     Name
0   26     Alex
1   36     Alan
2   25   Anchal
3   34   Andrew
4   32  Anthony
5   32     Alex
6   25     Alex
7   35   Arnold
8   36   Andrew
9   26   Arnold

In [41]:
# size
result_df = df.groupby("Name").size().reset_index(name="count")
result_df

      Name  count
0     Alan      1
1     Alex      3
2   Anchal      1
3   Andrew      2
4  Anthony      1
5   Arnold      2

In [42]:
#sort values
result_df.sort_values(["count", "Name"], ascending=False, inplace=True)
result_df.reset_index(drop=True, inplace=True)
result_df

      Name  count
0     Alex      3
1   Arnold      2
2   Andrew      2
3  Anthony      1
4   Anchal      1
5     Alan      1

In [43]:
#aggregate groupby
df.groupby(["Name"]).agg({"Age": ['min', 'max']}).reset_index()

      Name Age
           min max
0     Alan  36  36
1     Alex  25  32
2   Anchal  25  25
3   Andrew  34  36
4  Anthony  32  32
5   Arnold  26  35

# 5. Practice

* New concept: fill NA

In [44]:
#create random dataframes
user_df = pd.DataFrame(columns=["UserID", "Name", "Age"])

for idx in range(1, 9):

    name = get_name()
    while name in list(user_df["Name"]):
        name = get_name()

    data = {"Name": name, "UserID": idx, "Age": get_age()}

    user_df.loc[len(user_df)] = data
    
#rename column
user_df.rename(columns={"UserID":"ID"}, inplace=True)


# 딕셔너리 데이터를 데이터 프레임에 하나씩 추가하기
money_df = pd.DataFrame(columns=["ID", "Money"])
# np.random.randint(1, 9)
for _ in range(15):
    money_df.loc[len(money_df)] = {
        "ID": np.random.randint(1, 9),
        "Money": np.random.randint(1, 21) * 1000,
    }

In [45]:
result_df = pd.merge(money_df, user_df)
result_df.tail()

   ID  Money     Name Age
10  1  13000  Anthony  32
11  1   4000  Anthony  32
12  1   9000  Anthony  32
13  3  18000   Anchal  35
14  3   7000   Anchal  35

In [46]:
#aggregate groupby
money_list = result_df[["Name", "Money"]].groupby(["Name"])["Money"].sum().reset_index()
money_list.head()

      Name  Money
0     Adam  15000
1     Alan  54000
2     Alex  10000
3   Anchal  25000
4  Anthony  26000

In [47]:
#get full list of names
result = pd.merge(user_df, money_list, how="outer")
result

  ID     Name Age    Money
0  1  Anthony  32  26000.0
1  2   Andrew  26      NaN
2  3   Anchal  35  25000.0
3  4     Alex  21  10000.0
4  5    Billy  20  43000.0
5  6     Alan  31  54000.0
6  7    Alvin  39      NaN
7  8     Adam  35  15000.0

In [48]:
#fillna: replaces NaN
result.fillna(value=0, inplace=True)
result

   ID     Name  Age    Money
0   1  Anthony   32  26000.0
1   2   Andrew   26      0.0
2   3   Anchal   35  25000.0
3   4     Alex   21  10000.0
4   5    Billy   20  43000.0
5   6     Alan   31  54000.0
6   7    Alvin   39      0.0
7   8     Adam   35  15000.0

In [49]:
#change money data types
result.dtypes

ID         int64
Name      object
Age        int64
Money    float64
dtype: object

In [50]:
result['Money'] = result['Money'].astype("int")
result.head()

   ID     Name  Age  Money
0   1  Anthony   32  26000
1   2   Andrew   26      0
2   3   Anchal   35  25000
3   4     Alex   21  10000
4   5    Billy   20  43000

# 6. Pandas Input/Output

In [51]:
# load
titanic = pd.read_csv("datas/train.csv")
titanic.tail(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

# 7. Pivot

* A way to rearrange a dataframe. You choose which columns from the original dataframe you want to rearrage as **index, column, and value**
- `df.pivot(index, columns, values)`
    - Must be grouped by first, because this method doesn't support aggregations
- `df.pivot_table(values, index, columns, aggfunc)`

### 7.1 Method pivot

* `df.pivot(index, columns, values)`

In [52]:
#group by first
df1 = titanic.groupby(["Sex", "Pclass"]).size().reset_index(name="counts")
df1

      Sex  Pclass  counts
0  female       1      94
1  female       2      76
2  female       3     144
3    male       1     122
4    male       2     108
5    male       3     347

In [55]:
#pivot
df1.pivot("Sex", "Pclass", "counts")

Pclass    1    2    3
Sex
female   94   76  144
male    122  108  347

### 7.2 Mehod pivot_table

* `df.pivot_table(values, index, columns, aggfunc)`

In [57]:
#add a counter column
titanic["counts"] = 1
titanic.tail(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,counts
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S,1
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S,1
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S,1
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C,1
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q,1

In [60]:
#pivot
result = titanic.pivot_table("counts", "Pclass", "Survived", aggfunc=np.sum)
result

Survived    0    1
Pclass
1          80  136
2          97   87
3         372  119

In [62]:
#add row total
result["total"] = result[0] + result[1]
result

Survived    0    1  total
Pclass
1          80  136    216
2          97   87    184
3         372  119    491

In [63]:
#add column total
result.loc["total"] = result.loc[1] + result.loc[2] + result.loc[3]
result

Survived    0    1  total
Pclass
1          80  136    216
2          97   87    184
3         372  119    491
total     549  342    891